/** \file
 \brief  Перевод 2d->3d и обратно. Сопутствующие типы , фукции и т.д.
*
* \todo Перевод координат прожект /анпрожект. ...... 
*/

#pragma once
#include <gb/math/math.h>



namespace gb 
{

 namespace math
 {
 
 //! \brief  операции перевода 2d->3d и обратно. Сопутствующие типы , фукции и т.д.
	 // Сделал так, чтобы не перегружать базовые пространства имён,  если это по вашему
	 // "коряво" ,  то пишите на форуме.
  namespace proj
  {
//--------------------------------------------------------------------------------------
  
  
  
  
  
  
  
  
  
  
  
  
//--------------------------------------------------------------------------------------  
  } // end ns
 } // end ns
} // end ns
  
// end file